
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/14988189709)



<pre><code>Apply complete! Resources: 0 added, 17 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.http.my_file: Reading...
cloudflare_zero_trust_access_tag.tags["router"]: Refreshing state... [id=router]
cloudflare_zero_trust_access_tag.tags["wifi"]: Refreshing state... [id=wifi]
cloudflare_zero_trust_access_tag.tags["lan"]: Refreshing state... [id=lan]
cloudflare_zero_trust_access_identity_provider.google_oauth: Refreshing state... [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_tag.tags["container"]: Refreshing state... [id=container]
cloudflare_zero_trust_access_tag.tags["rpi"]: Refreshing state... [id=rpi]
cloudflare_zone.mylabs_dev: Refreshing state... [id=2859c4d6f599a36a424765646b79904e]
cloudflare_zone.ruzicka_dev: Refreshing state... [id=452e45a673326608122e759793a713f3]
cloudflare_zero_trust_access_policy.google_sso_access: Refreshing state... [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
data.http.my_file: Read complete after 0s [id=https://uptimerobot.com/inc/files/ips/IPv4andIPv6.txt]
cloudflare_zero_trust_access_tag.tags["wan"]: Refreshing state... [id=wan]
cloudflare_zero_trust_access_tag.tags["iot"]: Refreshing state... [id=iot]
cloudflare_zero_trust_access_policy.allow_all: Refreshing state... [id=6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0]
cloudflare_zone.xvx_cz: Refreshing state... [id=b84174cc7be41b21a9c36d62aff39e84]
cloudflare_dns_record.cname_petr_ruzicka_dev: Refreshing state... [id=560582f3686f60730649302acc4a54f6]
cloudflare_dns_record.cname_stats_ruzickap_github_io_ruzicka_dev: Refreshing state... [id=4e6ec427d1f22a61d21b3e6e401d9475]
cloudflare_dns_record.mx1_ruzicka_dev: Refreshing state... [id=72c3096bb3dfbbea638b11ec6a9084f1]
cloudflare_dns_record.mx2_ruzicka_dev: Refreshing state... [id=998e7ce6783759477c42e79b700f2a2b]
cloudflare_dns_record.cname_blog_ruzicka_dev: Refreshing state... [id=40b2f2c58767f934a85dd09857036003]
cloudflare_dns_record.txt_github_pages_challenge_ruzickap_ruzicka_dev: Refreshing state... [id=3278fdec9a5bee7946a9d4cd65dc7645]
cloudflare_dns_record.spf_txt_ruzicka_dev: Refreshing state... [id=37c6dd1d4f442313753b992ef048ab84]
cloudflare_dns_record.cname_www_ruzicka_dev: Refreshing state... [id=54daa51645ec0c8268be734d23ff39ea]
cloudflare_dns_record.mx3_ruzicka_dev: Refreshing state... [id=dc2ccc3ddf800440e8cb36b2750628ff]
cloudflare_dns_record.cname_ruzicka_dev: Refreshing state... [id=6012deab4c329d17d2c64685ab381aa1]
cloudflare_dns_record.txt_cf2024_1_domainkey_ruzicka_dev: Refreshing state... [id=a21bd05ef17e1277f9f0ec1756b8f320]
cloudflare_dns_record.ns2_k8s_mylabs_dev: Refreshing state... [id=735395882005c878dfcfdaa0fc3c0b4a]
cloudflare_dns_record.ns3_aws_mylabs_dev: Refreshing state... [id=d207b2188295decc79b025a03bbd5928]
cloudflare_dns_record.ns4_aws_mylabs_dev: Refreshing state... [id=9bdfd9d4ad07b2946910408a7abbf540]
cloudflare_dns_record.ns4_k8s_mylabs_dev: Refreshing state... [id=edeb28878e93de06491a321036737864]
cloudflare_dns_record.ns1_aws_mylabs_dev: Refreshing state... [id=fdb99a821d84d9685861804054b04cf9]
cloudflare_dns_record.mx1_mylabs_dev: Refreshing state... [id=83cf9c058c96fce13afbf648b00891a5]
cloudflare_dns_record.ns2_aws_mylabs_dev: Refreshing state... [id=c09981c61ebf3756ff5f717ced460d7c]
cloudflare_dns_record.cname_mylabs_dev: Refreshing state... [id=512175704937e92cfc53a4711bcfba1a]
cloudflare_dns_record.spf_txt_mylabs_dev: Refreshing state... [id=12b0353211ea68f2e01d41c96582087a]
cloudflare_dns_record.mx2_mylabs_dev: Refreshing state... [id=3224096c7ca0547917f9c0026aa65f88]
cloudflare_dns_record.mx3_mylabs_dev: Refreshing state... [id=54c0a1c1eca296a1e1449ef5300fe3d2]
cloudflare_dns_record.cname_www_mylabs_dev: Refreshing state... [id=d3feaa152c14f6f38c69d384ba4f5111]
cloudflare_dns_record.ns1_k8s_mylabs_dev: Refreshing state... [id=bb4675cb0c3a2fcb29cec8d26a466d54]
cloudflare_dns_record.ns3_k8s_mylabs_dev: Refreshing state... [id=8409985e399eb9ff87bb26e9663b8903]
cloudflare_dns_record.txt_cf2024_1_domainkey_mylabs_dev: Refreshing state... [id=8820748f17e5b98fb90dd2caf4b51711]
cloudflare_dns_record.cname_alloy_rpi_xvx_cz: Refreshing state... [id=fe0ebe98a1d07a251d6b2dbddf044746]
cloudflare_dns_record.cname_cestovani_xvx_cz: Refreshing state... [id=13762e91a934735c093cd338d3f9b577]
cloudflare_dns_record.mx3_xvx_cz: Refreshing state... [id=3b89d2aec9feac9aaf4f591f6dc38587]
cloudflare_dns_record.cname_svatba_xvx_cz: Refreshing state... [id=6deb708f40e8cdc44af9f26214041d50]
cloudflare_dns_record.cname_prometheus_rpi_xvx_cz: Refreshing state... [id=02b555b7c78e5c97cd356b2c34ae15e5]
cloudflare_dns_record.txt_google_site_verification_xvx_cz: Refreshing state... [id=d3dec2add7b745e8ad95b9dde7ec4692]
cloudflare_zero_trust_list.uptimerobot_ips: Refreshing state... [id=45069e77-095c-462c-86d7-98fa9731a0da]
cloudflare_dns_record.txt_dmarc1_dmarc_xvx_cz: Refreshing state... [id=2ec53d109d14c8bb15fb8dcaced94292]
cloudflare_dns_record.mx1_xvx_cz: Refreshing state... [id=088cef876698a0ddcbca2026a21bfd95]
cloudflare_dns_record.cname_ruzickovabozena_xvx_cz: Refreshing state... [id=2dd46a0ff555377bb1ca39e2294e2734]
cloudflare_dns_record.a_gate_bracha_xvx_cz: Refreshing state... [id=9be04858272f22620ad1b27cd7b5f76e]
cloudflare_dns_record.cname_byt_xvx_cz: Refreshing state... [id=4ec0db0c0a3324765b5d8909e6edba5f]
cloudflare_dns_record.txt_acme_challenge_auth_infra_xvx_cz: Refreshing state... [id=266ba9c4df2471841c54dc3cec8821a5]
cloudflare_dns_record.cname_cadvisor_rpi_xvx_cz: Refreshing state... [id=bd354be8c30144e421e3290fee4a4c50]
cloudflare_dns_record.cname_linux_xvx_cz: Refreshing state... [id=5df4b6886b43d1d615360f3bab861527]
cloudflare_dns_record.cname_transmission_xvx_cz: Refreshing state... [id=b057f46a71fc1081b09ef0d377a02d39]
cloudflare_dns_record.cname_xvx_cz: Refreshing state... [id=129f72a534e70fdde7f7b0d0d8de09f8]
cloudflare_dns_record.cname_hass_rpi_xvx_cz: Refreshing state... [id=f785684417681cdefe2c5facd7bf5faa]
cloudflare_dns_record.mx5_xvx_cz: Refreshing state... [id=5aa6aab8b2b89bebf1907dc080e058b5]
cloudflare_dns_record.cname_gate_xvx_cz: Refreshing state... [id=d401cd09a3dc60e26881209b3fd2094e]
cloudflare_dns_record.cname_petr_xvx_cz: Refreshing state... [id=7d211321aa14c8b2bb46b5884370bb0d]
cloudflare_dns_record.cname_www_svatba_xvx_cz: Refreshing state... [id=1c9fcf3f9970c7205ac0866edfd967f3]
cloudflare_dns_record.cname_uzg_01_xvx_cz: Refreshing state... [id=08cc60e4152df6e4f84d11031d29bf83]
cloudflare_dns_record.mx2_xvx_cz: Refreshing state... [id=f0b0eafd0d4dbe89a2e5130ed376afcf]
cloudflare_dns_record.cname_www_xvx_cz: Refreshing state... [id=c7fb0d86b11373cd9cde58aa1ae5a789]
cloudflare_dns_record.cname_www_linux_old_xvx_cz: Refreshing state... [id=4a810c020747f52c0e5638fb16034770]
cloudflare_dns_record.cname_linux_old_xvx_cz: Refreshing state... [id=15fb100a9e230402aa1c86f3d58efe9e]
cloudflare_dns_record.cname_grafana_rpi_xvx_cz: Refreshing state... [id=3907d43bb20ae6e80ef5387ca9df0005]
cloudflare_dns_record.cname_msr_2_xvx_cz: Refreshing state... [id=dd9087ccd26e425a4d3414bc8aa486c9]
cloudflare_dns_record.txt_dkim1_google_domainkey_xvx_cz: Refreshing state... [id=7a6aca074c2c843300481dd24b367db9]
cloudflare_dns_record.cname_www_linux_xvx_cz: Refreshing state... [id=7a420cfcd4e1d79d95988c348ee138f7]
cloudflare_dns_record.cname_zigbee2mqtt_rpi_xvx_cz: Refreshing state... [id=a390a6c185f97d234f5dae8146417fce]
cloudflare_dns_record.cname_gate_ssh_xvx_cz: Refreshing state... [id=aa7621acb99d6a8bf4bddd8fcb8881c5]
cloudflare_dns_record.a_raspi_xvx_cz: Refreshing state... [id=42b1926b3be431f1d598085c32193eca]
cloudflare_dns_record.cname_www_ruzickovabozena_xvx_cz: Refreshing state... [id=74c6f605b8e3bdadda60e83b1072da46]
cloudflare_dns_record.cname_rpi_xvx_cz: Refreshing state... [id=2a528d96927361d0b36eb45a0bd967a9]
cloudflare_dns_record.cname_kodi_rpi_xvx_cz: Refreshing state... [id=111f4a3922415708f1abc07c41daa081]
cloudflare_dns_record.a_stats_xvx_cz: Refreshing state... [id=b90204c8ccf0315cbf61a258dc06c2e3]
cloudflare_dns_record.mx4_xvx_cz: Refreshing state... [id=1f909e273d7f77cb8d2ade9c2b33f5a8]
cloudflare_dns_record.cname_esphome_rpi_xvx_cz: Refreshing state... [id=d0abbb8e26a6815d285126acd9aa6ac4]
cloudflare_dns_record.txt_spf1_xvx_cz: Refreshing state... [id=06890237b2511496df6878acb9824f33]
cloudflare_dns_record.cname_rpi_ssh_xvx_cz: Refreshing state... [id=8efd994ff69abfcb270dd308e3438f20]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Refreshing state... [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["raspi-2"]: Refreshing state... [id=1ce3c611-17f7-405a-b038-061edc6a7e4e]
cloudflare_zero_trust_tunnel_cloudflared.tunnels["gate-2"]: Refreshing state... [id=37c063d9-0dc7-49f8-82e3-5f5557a7e3ba]
cloudflare_dns_record.cname_zero_trust_tunnel_cloudflared["gate-2"]: Refreshing state... [id=1542ade7672c6b966037497fea3bdadc]
cloudflare_dns_record.cname_zero_trust_tunnel_cloudflared["raspi-2"]: Refreshing state... [id=f5cceef490064293337e45e278d1d554]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["gate-2"]: Refreshing state... [id=37c063d9-0dc7-49f8-82e3-5f5557a7e3ba]
cloudflare_zero_trust_tunnel_cloudflared_config.configs["raspi-2"]: Refreshing state... [id=1ce3c611-17f7-405a-b038-061edc6a7e4e]
cloudflare_zero_trust_access_application.applications["rpi-2"]: Refreshing state... [id=55015532-ac7f-4e27-8384-a9e07e7337a9]
cloudflare_zero_trust_access_application.applications["transmission-2"]: Refreshing state... [id=ac456fd1-facb-4edc-8939-e7dddbc66597]
cloudflare_zero_trust_access_application.applications["msr-2-2"]: Refreshing state... [id=ce836061-746b-40dc-b891-65147da8f9ee]
cloudflare_zero_trust_access_application.applications["gate-2"]: Refreshing state... [id=3bca7c79-e640-4b9f-b308-25186c516d85]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi-2"]: Refreshing state... [id=dd152de5-0de8-431b-bc13-d7dcbf050d09]
cloudflare_zero_trust_access_application.applications["prometheus-rpi-2"]: Refreshing state... [id=ea171e86-d39c-4c5d-9ce0-a06566356efd]
cloudflare_zero_trust_access_application.applications["kodi-rpi-2"]: Refreshing state... [id=fa412984-a630-46ca-908b-f9450d4e052f]
cloudflare_zero_trust_access_application.applications["alloy-rpi-2"]: Refreshing state... [id=795489f0-2d6a-4d95-9a59-3d13f56210e9]
cloudflare_zero_trust_access_application.applications["grafana-rpi-2"]: Refreshing state... [id=a003323e-7768-47cb-a9e1-d26b63c43d4f]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi-2"]: Refreshing state... [id=6432d16c-e2d4-45c2-8a06-889bf826d29a]
cloudflare_zero_trust_access_application.applications["hass-rpi-2"]: Refreshing state... [id=f7e66c54-502b-41f4-9933-a320da13ec85]
cloudflare_zero_trust_access_application.applications["uzg-01-2"]: Refreshing state... [id=e488f83b-a5ef-4ada-b983-2f30678e27e5]
cloudflare_zero_trust_access_application.applications["esphome-rpi-2"]: Refreshing state... [id=b145d8d8-6b02-44ff-82e0-588725c3b142]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # cloudflare_zero_trust_access_application.applications["alloy-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "3c7329ebcdf76ac25346176736da3cf4b47c8146f3a6e9a7c3d2fb0990669723" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "alloy-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "795489f0-2d6a-4d95-9a59-3d13f56210e9"
      + landing_page_design          = (known after apply)
        name                         = "alloy-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "alloy-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:18Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["cadvisor-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "36e1a385b530adb20fad2fb76da0ab88f36830ccc6d25df6ab53f262755178f9" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "cadvisor-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "6432d16c-e2d4-45c2-8a06-889bf826d29a"
      + landing_page_design          = (known after apply)
        name                         = "cadvisor-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "cadvisor-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:18Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["esphome-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "2a1aa122ae110462f483b53c3457619907218143710e47c289ba4f8c716acf19" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "esphome-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "b145d8d8-6b02-44ff-82e0-588725c3b142"
      + landing_page_design          = (known after apply)
        name                         = "esphome-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "esphome-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
          - "iot",
            "container",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:21Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["gate-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "a514df2c82e2a8d23f95e8c2b81f73682f88fce614997eb148cc97390f4a8c9d" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "gate-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "3bca7c79-e640-4b9f-b308-25186c516d85"
      + landing_page_design          = (known after apply)
        name                         = "gate-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "gate-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "lan",
            "router",
            "wan",
        ]
      ~ updated_at                   = "2025-05-13T04:21:22Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["grafana-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "64d1530b46934d325733fcb2757a0a89564ba400f8bbd81b3000b865c724fd49" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "grafana-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "a003323e-7768-47cb-a9e1-d26b63c43d4f"
      + landing_page_design          = (known after apply)
        name                         = "grafana-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "grafana-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:19Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["hass-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "12eb9df43c4de5201c143df17e62e9c4ad8e8dcedd95675b857162a9fbf036a1" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "hass-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "f7e66c54-502b-41f4-9933-a320da13ec85"
      + landing_page_design          = (known after apply)
        name                         = "hass-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0"
              - include    = [
                  - {
                      - everyone = {} -> null
                    },
                ] -> null
              - name       = "Allow All - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "hass-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
          - "iot",
            "container",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:18Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["kodi-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "fae59c26739e2f9ad62a5a074c54a888e1c8a7ee5867e5de54834533558fb701" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "kodi-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "fa412984-a630-46ca-908b-f9450d4e052f"
      + landing_page_design          = (known after apply)
        name                         = "kodi-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "kodi-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:24Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["msr-2-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "bed7c7bf9d9c159f4ae8c31c72f9d181110c5d8425cc9707b90a4c16c8e121f9" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "ce836061-746b-40dc-b891-65147da8f9ee"
      + landing_page_design          = (known after apply)
        name                         = "msr-2-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "iot",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:22Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["prometheus-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "dc45651b3e4f4261cabf962a7d0bc2e222ae4bc490281963e319db334d41ddb8" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "prometheus-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "ea171e86-d39c-4c5d-9ce0-a06566356efd"
      + landing_page_design          = (known after apply)
        name                         = "prometheus-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "prometheus-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:19Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "b5c8aa70a095f041c859a9c053e977458959bfec94ea10349300b9bdc36c3b42" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:08:03Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "55015532-ac7f-4e27-8384-a9e07e7337a9"
      + landing_page_design          = (known after apply)
        name                         = "rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "container",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:19Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["transmission-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "55c22e1d5c20ba855c4f7f5f4affb431adf66295a10edb133ccfd1759b5e32f9" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "transmission-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "ac456fd1-facb-4edc-8939-e7dddbc66597"
      + landing_page_design          = (known after apply)
        name                         = "transmission-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "transmission-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
        tags                         = [
            "router",
        ]
      ~ updated_at                   = "2025-05-13T04:21:23Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["uzg-01-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "ec1c48dc9efc04e4a7edd403090dd8b6b7ace07dcfbafe6dee610bdcdb25dfcc" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "uzg-01-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "e488f83b-a5ef-4ada-b983-2f30678e27e5"
      + landing_page_design          = (known after apply)
        name                         = "uzg-01-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "uzg-01-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "lan",
            "iot",
          + "lan",
        ]
      ~ updated_at                   = "2025-05-13T04:21:19Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi-2"] will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "applications" {
      ~ aud                          = "504a0a97f70ff66ba4d9d6e6de099a4085241044cd6bc5e340d6749f9d0ee753" -> (known after apply)
      ~ created_at                   = "2025-05-13T04:07:58Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "zigbee2mqtt-rpi-2.xvx.cz" -> null
            },
        ] -> null
        id                           = "dd152de5-0de8-431b-bc13-d7dcbf050d09"
      + landing_page_design          = (known after apply)
        name                         = "zigbee2mqtt-rpi-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "zigbee2mqtt-rpi-2.xvx.cz",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
          - "iot",
            "container",
          + "iot",
            "rpi",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-13T04:21:19Z" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "1a36ca86-d5c6-4e00-b003-006e2034fff3"
        name        = "My Test Google IDP - 2"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.allow_all will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "allow_all" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-12T05:27:46Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0"
        name             = "Allow All - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T04:21:17Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2c8404fb-81ca-4bab-835f-b933c0649e90"
        name             = "Google SSO Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T04:21:17Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 12 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
        name             = "UptimeRobot Direct Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-13T04:21:17Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifying... [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.google_sso_access: Modifying... [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_access_policy.allow_all: Modifying... [id=6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifying... [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_identity_provider.google_oauth: Modifications complete after 0s [id=1a36ca86-d5c6-4e00-b003-006e2034fff3]
cloudflare_zero_trust_access_policy.uptimerobot_direct_access: Modifications complete after 0s [id=afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77]
cloudflare_zero_trust_access_policy.google_sso_access: Modifications complete after 0s [id=2c8404fb-81ca-4bab-835f-b933c0649e90]
cloudflare_zero_trust_access_policy.allow_all: Modifications complete after 1s [id=6a2027a8-a9bd-4eaa-8fd3-06b0b50d27e0]
cloudflare_zero_trust_access_application.applications["grafana-rpi-2"]: Modifying... [id=a003323e-7768-47cb-a9e1-d26b63c43d4f]
cloudflare_zero_trust_access_application.applications["prometheus-rpi-2"]: Modifying... [id=ea171e86-d39c-4c5d-9ce0-a06566356efd]
cloudflare_zero_trust_access_application.applications["alloy-rpi-2"]: Modifying... [id=795489f0-2d6a-4d95-9a59-3d13f56210e9]
cloudflare_zero_trust_access_application.applications["transmission-2"]: Modifying... [id=ac456fd1-facb-4edc-8939-e7dddbc66597]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi-2"]: Modifying... [id=6432d16c-e2d4-45c2-8a06-889bf826d29a]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi-2"]: Modifying... [id=dd152de5-0de8-431b-bc13-d7dcbf050d09]
cloudflare_zero_trust_access_application.applications["rpi-2"]: Modifying... [id=55015532-ac7f-4e27-8384-a9e07e7337a9]
cloudflare_zero_trust_access_application.applications["esphome-rpi-2"]: Modifying... [id=b145d8d8-6b02-44ff-82e0-588725c3b142]
cloudflare_zero_trust_access_application.applications["hass-rpi-2"]: Modifying... [id=f7e66c54-502b-41f4-9933-a320da13ec85]
cloudflare_zero_trust_access_application.applications["gate-2"]: Modifying... [id=3bca7c79-e640-4b9f-b308-25186c516d85]
cloudflare_zero_trust_access_application.applications["grafana-rpi-2"]: Modifications complete after 0s [id=a003323e-7768-47cb-a9e1-d26b63c43d4f]
cloudflare_zero_trust_access_application.applications["uzg-01-2"]: Modifying... [id=e488f83b-a5ef-4ada-b983-2f30678e27e5]
cloudflare_zero_trust_access_application.applications["alloy-rpi-2"]: Modifications complete after 0s [id=795489f0-2d6a-4d95-9a59-3d13f56210e9]
cloudflare_zero_trust_access_application.applications["msr-2-2"]: Modifying... [id=ce836061-746b-40dc-b891-65147da8f9ee]
cloudflare_zero_trust_access_application.applications["cadvisor-rpi-2"]: Modifications complete after 0s [id=6432d16c-e2d4-45c2-8a06-889bf826d29a]
cloudflare_zero_trust_access_application.applications["prometheus-rpi-2"]: Modifications complete after 0s [id=ea171e86-d39c-4c5d-9ce0-a06566356efd]
cloudflare_zero_trust_access_application.applications["kodi-rpi-2"]: Modifying... [id=fa412984-a630-46ca-908b-f9450d4e052f]
cloudflare_zero_trust_access_application.applications["transmission-2"]: Modifications complete after 0s [id=ac456fd1-facb-4edc-8939-e7dddbc66597]
cloudflare_zero_trust_access_application.applications["esphome-rpi-2"]: Modifications complete after 0s [id=b145d8d8-6b02-44ff-82e0-588725c3b142]
cloudflare_zero_trust_access_application.applications["hass-rpi-2"]: Modifications complete after 0s [id=f7e66c54-502b-41f4-9933-a320da13ec85]
cloudflare_zero_trust_access_application.applications["zigbee2mqtt-rpi-2"]: Modifications complete after 1s [id=dd152de5-0de8-431b-bc13-d7dcbf050d09]
cloudflare_zero_trust_access_application.applications["gate-2"]: Modifications complete after 1s [id=3bca7c79-e640-4b9f-b308-25186c516d85]
cloudflare_zero_trust_access_application.applications["msr-2-2"]: Modifications complete after 1s [id=ce836061-746b-40dc-b891-65147da8f9ee]
cloudflare_zero_trust_access_application.applications["kodi-rpi-2"]: Modifications complete after 1s [id=fa412984-a630-46ca-908b-f9450d4e052f]
cloudflare_zero_trust_access_application.applications["uzg-01-2"]: Modifications complete after 4s [id=e488f83b-a5ef-4ada-b983-2f30678e27e5]
cloudflare_zero_trust_access_application.applications["rpi-2"]: Modifications complete after 4s [id=55015532-ac7f-4e27-8384-a9e07e7337a9]

Apply complete! Resources: 0 added, 17 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"tofu-cloudflare","PRNumber":195,"Program":"tfcmt","SHA1":"d7c2f2848d03aa1ae5f4db5dcc9a166386759a99","Vars":{},"WorkflowName":"tofu-cloudflare"} -->